[{
  "thumb": "expedition-300.png",
  "title": "expedition!",
  "tags": ["education", "games", "fullstack", "mobile"],
  "links": {
    "site": "https://savageinter.net/expedition.html"
  },
  "org": "Savage Internet",
  "years": [2017, null],
  "description": "expedition! is a mobile augmented-reality game that connects players around location-based collaborative storytelling tasks: think Geocaching meets historical fan fiction.  Currently in development; release schedule coming soon."
}, {
  "thumb": "jugger-300.jpg",
  "title": "Jugger Toronto",
  "tags": ["games", "physical", "volunteer"],
  "links": {
    "fb": "https://www.facebook.com/groups/JuggerToronto"
  },
  "org": null,
  "years": [2017, null],
  "description": "Jugger Toronto is a Toronto-based sports club for the sport of Jugger.  As one of the club co-founders, I help with just about everything: social media outreach, events, practice planning, equipment building / maintenance, and tournament preparation.  I also, of course, continue to play this wonderful sport!"
}, {
  "thumb": "puzzling-madness-300.png",
  "title": "The Puzzling Madness of John A. Macdonald",
  "tags": ["education", "games", "physical", "speaking"],
  "links": {
    "fb": "https://www.facebook.com/puzzlingmadness/",
    "twitter": "https://twitter.com/puzzlingmadness",
    "youtube": "https://www.youtube.com/watch?v=973w2QTswQI",
    "site": "https://puzzlingmadness.ca"
  },
  "org": "Savage Internet",
  "years": [2016, null],
  "description": "The Puzzling Madness of John A. Macdonald is a puzzle/scavenger hunt set in Toronto circa 1867.  Players unravel a plot to undermine Confederation, using historical handbills, maps, and sites.  As co-designer, I was involved with pretty much everything: initial research, puzzle design, playtesting, scriptwriting, casting, direction, costumes, props, website, marketing, social media outreach...it was a daunting task!  The game was developed through 2016-2017, and will be opened to the public in summer 2018."
}, {
  "thumb": "datasense-300.png",
  "title": "Data Sense",
  "tags": ["dataviz", "education", "fullstack", "speaking"],
  "links": {
    "site": "https://makesenseofdata.com/"
  },
  "org": "Intel Labs",
  "years": [2013, null],
  "description": "Data Sense is a project with Intel Labs to make data analysis accessible to non-technical end users through interactive data visualization.  It consists of a web application (Vue / d3, Spring MVC, MySQL) backed by a data-syncing service (Spring MVC, Thrift) and a data analysis engine (node.js, express).  As the lead developer, I've built large sections of this architecture, and have been actively involved in feature development, bug fixes, and profiling / optimization.  I also gave a talk on Data Sense at QS 2015.  This project is a spiritual successor to datafist, albeit much more usable and performant."
}, {
  "thumb": "science-march-300.png",
  "title": "March for Science Toronto",
  "tags": ["speaking", "volunteer"],
  "links": {
    "fb": "https://www.facebook.com/ScienceMarchTO/",
    "twitter": "https://twitter.com/ScienceMarchTO",
    "site": "https://sciencemarchto.ca/"
  },
  "org": null,
  "years": [2017, 2017],
  "description": "March for Science Toronto was a satellite march of the larger March for Science movement.  I co-developed our website with Valkyrie Savage, and also served as the primary media contact.  The march itself was quite successful, with over 4000 in attendance, great local media coverage, and surprisingly smooth execution on march day."
}, {
  "thumb": "locatrix-300.jpg",
  "title": "Locatrix",
  "tags": ["fullstack", "mobile"],
  "links": {
    "site": "https://locatrix.savageinter.net",
    "android": "https://play.google.com/store/apps/details?id=net.savageinter.locatrix"
  },
  "org": "Savage Internet",
  "years": [2016, 2017],
  "description": "Locatrix is an Android app for tracking your location and sharing it with friends, family, and co-workers.  Unlike other location-tracking tools, Locatrix preserves your privacy by only revealing city-level location every 24 hours, and by never sending raw location data off the device.  The app sends location updates to our web service (node.js, hapijs, PostgreSQL).  This service also provides a web interface, through which users can embed iframe or image widgets showing their city-level location and/or timezone.  To avoid sending location off-device, we run nearest-neighbor lookups against a quadtree index bundled with the app."
}, {
  "thumb": "woman-of-bronze-300.jpg",
  "title": "Doc Savage: Woman of Bronze",
  "tags": ["games", "physical"],
  "links": {
    "other": [
      {"title": "Game Documents", "href": "https://drive.google.com/drive/folders/0B015tvjlD7Dmc0VqOGpyUmZhSkU?usp=sharing"}
    ]
  },
  "org": "Savage Internet",
  "years": [2016, 2016],
  "description": "Doc Savage: Woman of Bronze is an Oakland-based puzzle hunt game tied to the city's unique history and architecture. It features letter locks hidden around the city, each unlocked by a four-letter word that the players must deduce from clues, riddles, and puzzles.  I designed the game structure, puzzles, and narrative, and then organized and ran the game for 15 players as part of Valkyrie's graduation party."
}, {
  "thumb": "jugger-300.jpg",
  "title": "Jugger California",
  "tags": ["games", "physical", "volunteer"],
  "links": {
    "other": [
      {"title": "Instructable for Jugger Weapons", "href": "http://instructables.com/id/Jugger-Weapons"},
      {"title": "East Bay Nerd Nite Talk", "href": "https://youtu.be/LZ1WYXq14u0?t=2h52m40s"}
    ]
  },
  "org": null,
  "years": [2014, 2016],
  "description": "Jugger California is a San Francisco-area league I co-founded with Valkyrie for the sport of Jugger, a blend of capture the flag, fencing, and rugby.  The sport enjoys relative popularity in Germany, but we introduced the game to the Bay Area.  We personally showcased the sport at local games (Come Out & Play) and art (Figment) festivals, and even gave a 20-minute presentation where we explored the lineage of Jugger and similar games back to pre-Roman times.  We constructed the first set of equipment ourselves from PVC and pipe insulation, and directed construction of further sets.  Our ensuing write-up on Instructables was featured."
}, {
  "thumb": "toroid-300.png",
  "title": "Toroid: Tor Node Map",
  "tags": ["dataviz"],
  "links": {
    "site": "https://toroid.savageinter.net/",
    "github": "https://github.com/candu/toroid"
  },
  "org": "Savage Internet",
  "years": [2014, 2014],
  "description": "Toroid is an interactive worldwide map of Tor nodes.  It uses d3 and Leaflet for visualization, plus a simple cron job to retrieve an index of Tor nodes from the Onionoo API."
}, {
  "thumb": "async-300.png",
  "title": "Talk: Async JS Patterns",
  "tags": ["education", "speaking"],
  "links": {
    "other": [
      {"title": "Interactive Talk Slides (HTML / JS)", "href": "http://candu.github.io/presentations/html/20140729-jquery-async-javascript/"}
    ]
  },
  "org": "Savage Internet",
  "years": [2014, 2014],
  "description": "I gave a talk at the East Bay JavaScript Meetup on the quirks and pitfalls of JavaScript's event loop, as well as on patterns (and anti-patterns!) for handling asynchronous tasks in JavaScript.  Some of the material has been made obsolete by widespread ES6 adoption / tooling, but most of the discussion is still quite useful."
}, {
  "thumb": "hoedown-300.png",
  "title": "Kinoma Hoedown",
  "tags": ["games", "hardware", "speaking"],
  "links": {
    "github": "https://github.com/savageinternet/hoedown",
    "other": [
      {"title": "Kinoma Blog Post", "href": "http://blog.kinoma.com/2014/06/hoedown-with-the-savages-and-kinoma-create/"}
    ]
  },
  "org": "Kinoma / Marvell",
  "years": [2013, 2013],
  "description": "Using the newly-announced Kinoma Create hardware prototyping platform, Valkyrie Savage and I built Hoedown!, a unique game that we demonstrated at the Kinoma SXSW Trade Show stand during SXSW 2014.  In Hoedown!, players are measured for different qualities using physical sensors. These measurements determine a character class for the player, which is presented to them in the form of a character sheet printed on a BERG Little Printer. Players then find other players from each of the seven character classes, with whom they complete small shared tasks."
}, {
  "thumb": "datafist-300.png",
  "title": "datafist",
  "tags": ["dataviz", "education"],
  "links": {
    "github": "https://github.com/candu/datafist",
    "youtube": "https://www.youtube.com/watch?v=ypitHPXKa8M",
    "other": [
      {"title": "Blog Post", "href": "https://candu.github.io/blog/2012/12/21/datafist-exploration-and-analysis/"}
    ]
  },
  "org": "Savage Internet",
  "years": [2012, 2013],
  "description": "datafist is an in-browser toolkit for visually exploring your personal data.  Similar to Max or PureData, datafist offers a visual programming interface built around a toolkit of simple, composable operations. As you play around with these operations, the result is simultaneously visualized.   My goal was to create a simple open-source tool to help all self-trackers get more out of their personal data, regardless of experience with programming or statistics.  There is no backend; just clone the repo and go!  It can handle files of up to ~20K data points quite easily.  Visualizations are built on top of d3, with mootools as the base JavaScript library.  It also makes use of HTML5 drag-and-drop and FileReader APIs for CSV file import."
}, {
  "thumb": "image_mask.png",
  "title": "Proximity Dress",
  "tags": ["hardware"],
  "links": {
    "github": "https://github.com/candu/proximity-dress"
  },
  "org": null,
  "years": [2012, 2012],
  "description": "I worked with Valkyrie Savage to design, build, and program Arduino-based electronics for her wedding dress. Using two XBee modules, an Arduino Fio, and an Arduino Lilypad with the XBee breakout board, we constructed a proximity sensor based on RSSI pin signal strength between the two modules. This sensor was used to illuminate a series of LEDs on her dress, providing a visual indication of our mutual proximity."
}, {
  "thumb": "image_mask.png",
  "title": "Core Photos Engineer",
  "tags": ["fullstack"],
  "links": {},
  "org": "Facebook",
  "years": [2011, 2012],
  "description": "After spending a year with the Search Infrastructure team, I switched gears and moved to the Core Photos team. This horizontal role switching is highly encouraged at Facebook.  I took a failing face detection/recognition system and rebuilt it for scalability, achieving 99.9% reliability and a tagging boost of 2%. I then worked with Lubomir Bourdev to build easily reusable detection/recognition components, making it easier to drive further improvements to our tag suggestion systems.  The bulk of my time with Core Photos was spent driving a major initiative to migrate all photos-related data into TAO. TAO provides access to Facebook's social graph data via a simple API that abstracts away Memcache/MySQL.  The migration required extensive planning, frequent communication both within and across teams, and broad knowledge of Facebook's codebase. When I joined Core Photos, several people had previously tried and failed to gain traction on this project. By the time I left, we had successfully migrated all photo tags and had a clear plan for completing the rest of the migration."
}, {
  "thumb": "image_mask.png",
  "title": "Search Infrastructure Engineer",
  "tags": ["fullstack"],
  "links": {},
  "org": "Facebook",
  "years": [2010, 2011],
  "description": "I built search for Facebook Groups, the first fulltext search product to use Facebook's in-house distributed graph search system. This was a full-stack project; I was responsible for everything from indexing to realtime updates to frontend development. After rollout, I maintained this product by managing a weekly push process, building dashboards, and working with teammates to resolve operational issues. I also improved search quality, using detailed query log analysis to prioritize fixes to the indexing process and UI.  After that, I worked more closely with the Search Infrastructure team on improving our core graph search system. I automated index builds, making the process of pushing our 50 TB index quicker and more reliable. As part of the oncall rotation, I periodically managed that push process end-to-end. I instrumented our system to report a breakdown of CPU/network usage, allowing us to precisely target our optimizations at specific common queries and high-volume callers."
}, {
  "thumb": "image_mask.png",
  "title": "XHPy",
  "tags": [],
  "links": {
    "github": "https://github.com/candu/xhpy"
  },
  "org": null,
  "years": [2010, 2011],
  "description": "XHPy is a Python port of Facebook's XHP.  It installs an import hook that dynamically rewrites code as it is imported.  The parser uses Pratt top-down operator precedence, and is composed of a series of generators that stream the output of tokenize."
}, {
  "thumb": "image_mask.png",
  "title": "Bike To The Earth",
  "tags": [],
  "links": {
    "site": "https://savageinternet.github.io/biketotheearth/index.html"
  },
  "org": null,
  "years": [2010, 2010],
  "description": "Valkyrie Savage and I biked from Copenhagen to Istanbul via Portugal, a distance of over 12 000 km in six months. On the way, we wrote daily blog posts totalling 150 000 words.  Before the trip, I also put together a proof-of-concept handlebar cam, using ffmpeg to compile videos from still frames. This setup was unfortunately impractical for our trip, but it made for some fun test rides."
}]
